axre/axre-ui/axre/axre-wire/soap-sample/executeCounterOpRule.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:EIservices">
   <soapenv:Header/>
   <soapenv:Body>
      <ns1:executeCounterOpRule xmlns:ns1="urn:EIservices" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <in0>?</in0>
         <in1>?</in1>
         <in2>?</in2>
      </ns1:executeCounterOpRule>
   </soapenv:Body>
</soapenv:Envelope>